---
title: SpecTypeId
classe: Autodesk.Revit.DB.SpecTypeId
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 151
---

# SpecTypeId

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ForgeTypeId Acceleration { get; }` | `SpecTypeId.Acceleration` | ForgeTypeId |
| `ForgeTypeId AirFlow { get; }` | `SpecTypeId.AirFlow` | ForgeTypeId |
| `ForgeTypeId AirFlowDensity { get; }` | `SpecTypeId.AirFlowDensity` | ForgeTypeId |
| `ForgeTypeId AirFlowDividedByCoolingLoad { get; }` | `SpecTypeId.AirFlowDividedByCoolingLoad` | ForgeTypeId |
| `ForgeTypeId AirFlowDividedByVolume { get; }` | `SpecTypeId.AirFlowDividedByVolume` | ForgeTypeId |
| `ForgeTypeId Angle { get; }` | `SpecTypeId.Angle` | ForgeTypeId |
| `ForgeTypeId AngularSpeed { get; }` | `SpecTypeId.AngularSpeed` | ForgeTypeId |
| `ForgeTypeId ApparentPower { get; }` | `SpecTypeId.ApparentPower` | ForgeTypeId |
| `ForgeTypeId ApparentPowerDensity { get; }` | `SpecTypeId.ApparentPowerDensity` | ForgeTypeId |
| `ForgeTypeId Area { get; }` | `SpecTypeId.Area` | ForgeTypeId |
| `ForgeTypeId AreaDividedByCoolingLoad { get; }` | `SpecTypeId.AreaDividedByCoolingLoad` | ForgeTypeId |
| `ForgeTypeId AreaDividedByHeatingLoad { get; }` | `SpecTypeId.AreaDividedByHeatingLoad` | ForgeTypeId |
| `ForgeTypeId AreaForce { get; }` | `SpecTypeId.AreaForce` | ForgeTypeId |
| `ForgeTypeId AreaForceScale { get; }` | `SpecTypeId.AreaForceScale` | ForgeTypeId |
| `ForgeTypeId AreaSpringCoefficient { get; }` | `SpecTypeId.AreaSpringCoefficient` | ForgeTypeId |
| `ForgeTypeId BarDiameter { get; }` | `SpecTypeId.BarDiameter` | ForgeTypeId |
| `ForgeTypeId CableTraySize { get; }` | `SpecTypeId.CableTraySize` | ForgeTypeId |
| `ForgeTypeId ColorTemperature { get; }` | `SpecTypeId.ColorTemperature` | ForgeTypeId |
| `ForgeTypeId ConduitSize { get; }` | `SpecTypeId.ConduitSize` | ForgeTypeId |
| `ForgeTypeId CoolingLoad { get; }` | `SpecTypeId.CoolingLoad` | ForgeTypeId |
| `ForgeTypeId CoolingLoadDividedByArea { get; }` | `SpecTypeId.CoolingLoadDividedByArea` | ForgeTypeId |
| `ForgeTypeId CoolingLoadDividedByVolume { get; }` | `SpecTypeId.CoolingLoadDividedByVolume` | ForgeTypeId |
| `ForgeTypeId CostPerArea { get; }` | `SpecTypeId.CostPerArea` | ForgeTypeId |
| `ForgeTypeId CostRateEnergy { get; }` | `SpecTypeId.CostRateEnergy` | ForgeTypeId |
| `ForgeTypeId CostRatePower { get; }` | `SpecTypeId.CostRatePower` | ForgeTypeId |
| `ForgeTypeId CrackWidth { get; }` | `SpecTypeId.CrackWidth` | ForgeTypeId |
| `ForgeTypeId CrossSection { get; }` | `SpecTypeId.CrossSection` | ForgeTypeId |
| `ForgeTypeId Currency { get; }` | `SpecTypeId.Currency` | ForgeTypeId |
| `ForgeTypeId Current { get; }` | `SpecTypeId.Current` | ForgeTypeId |
| `ForgeTypeId Custom { get; }` | `SpecTypeId.Custom` | ForgeTypeId |
| `ForgeTypeId DecimalSheetLength { get; }` | `SpecTypeId.DecimalSheetLength` | ForgeTypeId |
| `ForgeTypeId DemandFactor { get; }` | `SpecTypeId.DemandFactor` | ForgeTypeId |
| `ForgeTypeId Diffusivity { get; }` | `SpecTypeId.Diffusivity` | ForgeTypeId |
| `ForgeTypeId Displacement { get; }` | `SpecTypeId.Displacement` | ForgeTypeId |
| `ForgeTypeId Distance { get; }` | `SpecTypeId.Distance` | ForgeTypeId |
| `ForgeTypeId DuctInsulationThickness { get; }` | `SpecTypeId.DuctInsulationThickness` | ForgeTypeId |
| `ForgeTypeId DuctLiningThickness { get; }` | `SpecTypeId.DuctLiningThickness` | ForgeTypeId |
| `ForgeTypeId DuctSize { get; }` | `SpecTypeId.DuctSize` | ForgeTypeId |
| `ForgeTypeId Efficacy { get; }` | `SpecTypeId.Efficacy` | ForgeTypeId |
| `ForgeTypeId ElectricalFrequency { get; }` | `SpecTypeId.ElectricalFrequency` | ForgeTypeId |
| `ForgeTypeId ElectricalPotential { get; }` | `SpecTypeId.ElectricalPotential` | ForgeTypeId |
| `ForgeTypeId ElectricalPower { get; }` | `SpecTypeId.ElectricalPower` | ForgeTypeId |
| `ForgeTypeId ElectricalPowerDensity { get; }` | `SpecTypeId.ElectricalPowerDensity` | ForgeTypeId |
| `ForgeTypeId ElectricalResistivity { get; }` | `SpecTypeId.ElectricalResistivity` | ForgeTypeId |
| `ForgeTypeId ElectricalTemperature { get; }` | `SpecTypeId.ElectricalTemperature` | ForgeTypeId |
| `ForgeTypeId ElectricalTemperatureDifference { get; }` | `SpecTypeId.ElectricalTemperatureDifference` | ForgeTypeId |
| `ForgeTypeId Energy { get; }` | `SpecTypeId.Energy` | ForgeTypeId |
| `ForgeTypeId Factor { get; }` | `SpecTypeId.Factor` | ForgeTypeId |
| `ForgeTypeId Flow { get; }` | `SpecTypeId.Flow` | ForgeTypeId |
| `ForgeTypeId FlowPerPower { get; }` | `SpecTypeId.FlowPerPower` | ForgeTypeId |
| `ForgeTypeId Force { get; }` | `SpecTypeId.Force` | ForgeTypeId |
| `ForgeTypeId ForceScale { get; }` | `SpecTypeId.ForceScale` | ForgeTypeId |
| `ForgeTypeId HeatCapacityPerArea { get; }` | `SpecTypeId.HeatCapacityPerArea` | ForgeTypeId |
| `ForgeTypeId HeatGain { get; }` | `SpecTypeId.HeatGain` | ForgeTypeId |
| `ForgeTypeId HeatingLoad { get; }` | `SpecTypeId.HeatingLoad` | ForgeTypeId |
| `ForgeTypeId HeatingLoadDividedByArea { get; }` | `SpecTypeId.HeatingLoadDividedByArea` | ForgeTypeId |
| `ForgeTypeId HeatingLoadDividedByVolume { get; }` | `SpecTypeId.HeatingLoadDividedByVolume` | ForgeTypeId |
| `ForgeTypeId HeatTransferCoefficient { get; }` | `SpecTypeId.HeatTransferCoefficient` | ForgeTypeId |
| `ForgeTypeId HvacDensity { get; }` | `SpecTypeId.HvacDensity` | ForgeTypeId |
| `ForgeTypeId HvacEnergy { get; }` | `SpecTypeId.HvacEnergy` | ForgeTypeId |
| `ForgeTypeId HvacFriction { get; }` | `SpecTypeId.HvacFriction` | ForgeTypeId |
| `ForgeTypeId HvacMassPerTime { get; }` | `SpecTypeId.HvacMassPerTime` | ForgeTypeId |
| `ForgeTypeId HvacPower { get; }` | `SpecTypeId.HvacPower` | ForgeTypeId |
| `ForgeTypeId HvacPowerDensity { get; }` | `SpecTypeId.HvacPowerDensity` | ForgeTypeId |
| `ForgeTypeId HvacPressure { get; }` | `SpecTypeId.HvacPressure` | ForgeTypeId |
| `ForgeTypeId HvacRoughness { get; }` | `SpecTypeId.HvacRoughness` | ForgeTypeId |
| `ForgeTypeId HvacSlope { get; }` | `SpecTypeId.HvacSlope` | ForgeTypeId |
| `ForgeTypeId HvacTemperature { get; }` | `SpecTypeId.HvacTemperature` | ForgeTypeId |
| `ForgeTypeId HvacTemperatureDifference { get; }` | `SpecTypeId.HvacTemperatureDifference` | ForgeTypeId |
| `ForgeTypeId HvacVelocity { get; }` | `SpecTypeId.HvacVelocity` | ForgeTypeId |
| `ForgeTypeId HvacViscosity { get; }` | `SpecTypeId.HvacViscosity` | ForgeTypeId |
| `ForgeTypeId Illuminance { get; }` | `SpecTypeId.Illuminance` | ForgeTypeId |
| `ForgeTypeId IsothermalMoistureCapacity { get; }` | `SpecTypeId.IsothermalMoistureCapacity` | ForgeTypeId |
| `ForgeTypeId Length { get; }` | `SpecTypeId.Length` | ForgeTypeId |
| `ForgeTypeId LinearForce { get; }` | `SpecTypeId.LinearForce` | ForgeTypeId |
| `ForgeTypeId LinearForceScale { get; }` | `SpecTypeId.LinearForceScale` | ForgeTypeId |
| `ForgeTypeId LinearMoment { get; }` | `SpecTypeId.LinearMoment` | ForgeTypeId |
| `ForgeTypeId LinearMomentScale { get; }` | `SpecTypeId.LinearMomentScale` | ForgeTypeId |
| `ForgeTypeId LineSpringCoefficient { get; }` | `SpecTypeId.LineSpringCoefficient` | ForgeTypeId |
| `ForgeTypeId Luminance { get; }` | `SpecTypeId.Luminance` | ForgeTypeId |
| `ForgeTypeId LuminousFlux { get; }` | `SpecTypeId.LuminousFlux` | ForgeTypeId |
| `ForgeTypeId LuminousIntensity { get; }` | `SpecTypeId.LuminousIntensity` | ForgeTypeId |
| `ForgeTypeId Mass { get; }` | `SpecTypeId.Mass` | ForgeTypeId |
| `ForgeTypeId MassDensity { get; }` | `SpecTypeId.MassDensity` | ForgeTypeId |
| `ForgeTypeId MassPerUnitArea { get; }` | `SpecTypeId.MassPerUnitArea` | ForgeTypeId |
| `ForgeTypeId MassPerUnitLength { get; }` | `SpecTypeId.MassPerUnitLength` | ForgeTypeId |
| `ForgeTypeId Moment { get; }` | `SpecTypeId.Moment` | ForgeTypeId |
| `ForgeTypeId MomentOfInertia { get; }` | `SpecTypeId.MomentOfInertia` | ForgeTypeId |
| `ForgeTypeId MomentScale { get; }` | `SpecTypeId.MomentScale` | ForgeTypeId |
| `ForgeTypeId Number { get; }` | `SpecTypeId.Number` | ForgeTypeId |
| `ForgeTypeId Period { get; }` | `SpecTypeId.Period` | ForgeTypeId |
| `ForgeTypeId Permeability { get; }` | `SpecTypeId.Permeability` | ForgeTypeId |
| `ForgeTypeId PipeDimension { get; }` | `SpecTypeId.PipeDimension` | ForgeTypeId |
| `ForgeTypeId PipeInsulationThickness { get; }` | `SpecTypeId.PipeInsulationThickness` | ForgeTypeId |
| `ForgeTypeId PipeMassPerUnitLength { get; }` | `SpecTypeId.PipeMassPerUnitLength` | ForgeTypeId |
| `ForgeTypeId PipeSize { get; }` | `SpecTypeId.PipeSize` | ForgeTypeId |
| `ForgeTypeId PipingDensity { get; }` | `SpecTypeId.PipingDensity` | ForgeTypeId |
| `ForgeTypeId PipingFriction { get; }` | `SpecTypeId.PipingFriction` | ForgeTypeId |
| `ForgeTypeId PipingMass { get; }` | `SpecTypeId.PipingMass` | ForgeTypeId |
| `ForgeTypeId PipingMassPerTime { get; }` | `SpecTypeId.PipingMassPerTime` | ForgeTypeId |
| `ForgeTypeId PipingPressure { get; }` | `SpecTypeId.PipingPressure` | ForgeTypeId |
| `ForgeTypeId PipingRoughness { get; }` | `SpecTypeId.PipingRoughness` | ForgeTypeId |
| `ForgeTypeId PipingSlope { get; }` | `SpecTypeId.PipingSlope` | ForgeTypeId |
| `ForgeTypeId PipingTemperature { get; }` | `SpecTypeId.PipingTemperature` | ForgeTypeId |
| `ForgeTypeId PipingTemperatureDifference { get; }` | `SpecTypeId.PipingTemperatureDifference` | ForgeTypeId |
| `ForgeTypeId PipingVelocity { get; }` | `SpecTypeId.PipingVelocity` | ForgeTypeId |
| `ForgeTypeId PipingViscosity { get; }` | `SpecTypeId.PipingViscosity` | ForgeTypeId |
| `ForgeTypeId PipingVolume { get; }` | `SpecTypeId.PipingVolume` | ForgeTypeId |
| `ForgeTypeId PointSpringCoefficient { get; }` | `SpecTypeId.PointSpringCoefficient` | ForgeTypeId |
| `ForgeTypeId PowerPerFlow { get; }` | `SpecTypeId.PowerPerFlow` | ForgeTypeId |
| `ForgeTypeId PowerPerLength { get; }` | `SpecTypeId.PowerPerLength` | ForgeTypeId |
| `ForgeTypeId Pulsation { get; }` | `SpecTypeId.Pulsation` | ForgeTypeId |
| `ForgeTypeId ReinforcementArea { get; }` | `SpecTypeId.ReinforcementArea` | ForgeTypeId |
| `ForgeTypeId ReinforcementAreaPerUnitLength { get; }` | `SpecTypeId.ReinforcementAreaPerUnitLength` | ForgeTypeId |
| `ForgeTypeId ReinforcementCover { get; }` | `SpecTypeId.ReinforcementCover` | ForgeTypeId |
| `ForgeTypeId ReinforcementLength { get; }` | `SpecTypeId.ReinforcementLength` | ForgeTypeId |
| `ForgeTypeId ReinforcementSpacing { get; }` | `SpecTypeId.ReinforcementSpacing` | ForgeTypeId |
| `ForgeTypeId ReinforcementVolume { get; }` | `SpecTypeId.ReinforcementVolume` | ForgeTypeId |
| `ForgeTypeId Rotation { get; }` | `SpecTypeId.Rotation` | ForgeTypeId |
| `ForgeTypeId RotationalLineSpringCoefficient { get; }` | `SpecTypeId.RotationalLineSpringCoefficient` | ForgeTypeId |
| `ForgeTypeId RotationalPointSpringCoefficient { get; }` | `SpecTypeId.RotationalPointSpringCoefficient` | ForgeTypeId |
| `ForgeTypeId RotationAngle { get; }` | `SpecTypeId.RotationAngle` | ForgeTypeId |
| `ForgeTypeId SectionArea { get; }` | `SpecTypeId.SectionArea` | ForgeTypeId |
| `ForgeTypeId SectionDimension { get; }` | `SpecTypeId.SectionDimension` | ForgeTypeId |
| `ForgeTypeId SectionModulus { get; }` | `SpecTypeId.SectionModulus` | ForgeTypeId |
| `ForgeTypeId SectionProperty { get; }` | `SpecTypeId.SectionProperty` | ForgeTypeId |
| `ForgeTypeId SheetLength { get; }` | `SpecTypeId.SheetLength` | ForgeTypeId |
| `ForgeTypeId SiteAngle { get; }` | `SpecTypeId.SiteAngle` | ForgeTypeId |
| `ForgeTypeId Slope { get; }` | `SpecTypeId.Slope` | ForgeTypeId |
| `ForgeTypeId SpecificHeat { get; }` | `SpecTypeId.SpecificHeat` | ForgeTypeId |
| `ForgeTypeId SpecificHeatOfVaporization { get; }` | `SpecTypeId.SpecificHeatOfVaporization` | ForgeTypeId |
| `ForgeTypeId Speed { get; }` | `SpecTypeId.Speed` | ForgeTypeId |
| `ForgeTypeId Stationing { get; }` | `SpecTypeId.Stationing` | ForgeTypeId |
| `ForgeTypeId StationingInterval { get; }` | `SpecTypeId.StationingInterval` | ForgeTypeId |
| `ForgeTypeId Stress { get; }` | `SpecTypeId.Stress` | ForgeTypeId |
| `ForgeTypeId StructuralFrequency { get; }` | `SpecTypeId.StructuralFrequency` | ForgeTypeId |
| `ForgeTypeId StructuralVelocity { get; }` | `SpecTypeId.StructuralVelocity` | ForgeTypeId |
| `ForgeTypeId SurfaceAreaPerUnitLength { get; }` | `SpecTypeId.SurfaceAreaPerUnitLength` | ForgeTypeId |
| `ForgeTypeId ThermalConductivity { get; }` | `SpecTypeId.ThermalConductivity` | ForgeTypeId |
| `ForgeTypeId ThermalExpansionCoefficient { get; }` | `SpecTypeId.ThermalExpansionCoefficient` | ForgeTypeId |
| `ForgeTypeId ThermalGradientCoefficientForMoistureCapacity { get; }` | `SpecTypeId.ThermalGradientCoefficientForMoistureCapacity` | ForgeTypeId |
| `ForgeTypeId ThermalMass { get; }` | `SpecTypeId.ThermalMass` | ForgeTypeId |
| `ForgeTypeId ThermalResistance { get; }` | `SpecTypeId.ThermalResistance` | ForgeTypeId |
| `ForgeTypeId Time { get; }` | `SpecTypeId.Time` | ForgeTypeId |
| `ForgeTypeId UnitWeight { get; }` | `SpecTypeId.UnitWeight` | ForgeTypeId |
| `ForgeTypeId Volume { get; }` | `SpecTypeId.Volume` | ForgeTypeId |
| `ForgeTypeId WarpingConstant { get; }` | `SpecTypeId.WarpingConstant` | ForgeTypeId |
| `ForgeTypeId Wattage { get; }` | `SpecTypeId.Wattage` | ForgeTypeId |
| `ForgeTypeId Weight { get; }` | `SpecTypeId.Weight` | ForgeTypeId |
| `ForgeTypeId WeightPerUnitLength { get; }` | `SpecTypeId.WeightPerUnitLength` | ForgeTypeId |
| `ForgeTypeId WireDiameter { get; }` | `SpecTypeId.WireDiameter` | ForgeTypeId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```